---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard
source: html/867a2fd4-f018-4320-5464-f28e7174ffb3.htm
---
# StructuralSectionPipeStandard Members

Creates a new instance of Structural Section Pipe Standard shape with the associated set of parameters,
 used to attach to structural element.